Гамма, Э. Приемы объектно-ориентированного проектирования. Паттерны проектирования [Текст] / Э. Гамма, Р. Хелм, Р. Джонсон, Д. Влиссидес. – СПб.: Питер, 2010. – 368 с.

Гиванс, Д. Д. Паттерны проектирования API [Текст] / Д. Д. Гиванс. – СПб.: Питер, 2023. – 512 с.

Карлосон, Л. Д. Redis in Action [Text] / by L. D. Carloson. – Manning, 2013. – 320 p.

Ньюмен, С. Создание микросервисов [Текст] / С. Ньюмен. – 2-е изд. – СПб.: Питер, 2023. – 624 с.

Раджпут, Д. Spring. Все паттерны проектирования [Текст] / Д. Раджпут. – СПб.: Питер, 2017. – 320 с.

Рогов, Е. В. PostgreSQL 16 изнутри [Текст] / Е. В. Рогов. – М.: ДМК Пресс, 2024. – 664 с.

Скит, Д. Software: ошибки и компромиссы при разработке ПО [Текст] / Д. Скит. – СПб.: Питер, 2023. – 464 с.

Стефанов, С. React. Быстрый старт [Текст] / С. Стефанов. – 2-е изд. – СПб.: Питер, 2023. – 304 с.

Тидвелл, Д. Разработка интерфейсов. Паттерны проектирования [Текст] / Д. Тидвелл. – 3-е изд. – СПб.: Питер, 2022. – 560 с.

Ultralytics: документация по ИИ и компьютерному зрению [сайт]. – [б. м.], 2025 – . – URL: https://docs.ultralytics.com/ru/ (дата обращения: 14.05.2025). – Текст: электронный.

Шарипа, Г. Apache Kafka. Потоковая обработка и анализ данных [Текст] / Г. Шарипа, Т. Палино. – 2-е изд. – СПб.: Питер, 2023. – 512 с.

Шилдс, У. SQL: быстрое погружение [Текст] / У. Шилдс. – СПб.: Питер, 2022. – 224 с.

Эккель, Б. Философия Java [Текст] / Б. Эккель. – 4-е изд. – СПб.: Питер, 2022. – 1168 с.